import React from 'react';
import { ScrollView } from 'react-native';
import { ExpandableListView } from 'react-native-expandable-listview';

const info1 = `امروزه با توجه به حجم ترافیک خودروها و شلوغی فروشگاه ها امکان خرید مایحتاج زندگی کمی دشوارتر از پیش شده است٬ به طوری که برای خرید یکی از اقلام مورد نیاز شاید نیاز باشد مدت زمان بسیار زیادی را در طول روز به آن اختصاص دهید و حتی شاید بارها برایتان اتفاق افتاده باشد که محصول و برندی از محصول که محبوب شماست در فروشگاه موجود نباشد. فروشگاه اینترنتی بافردو این امکان را برای شما فراهم می کند که در کمترین زمان ممکن محصول مورد نظر خود را به راحتی خریداری نمایید. فروشگاه اینترنتی بافردو با گستره ی متنوعی از محصولات و ارسال رایگان به نقاط مختلف شهر فارغ از هرگونه شلوغی و ترافیک تجربه خرید آسان و آسوده را برای شما فراهم می کند.

یکی از مزایای بافردو که او را از دیگر فروشگاه های اینترنتی متمایز می کند٬ علاوه بر محصولات سوپرمارکتی٬ ارائه سبزیجات تازه و ارگانیک و خرد شده و هم چنین محصولات پروتئینی تازه مانند گوشت و مرغ و ماهی به مشتریان می باشد که در صورت سفارش برای جلوگیری از فساد و خرابی آن ها تحویل آن در کمترین زمان ممکن در همان روز سفارش انجام می گردد.   

از دیگر مزایای بافردو گارانتی کیفیت محصول می باشد٬ که شامل تعویض محصول در صورت عدم رضایت مشتری از کیفیت محصول و قیمت آن می باشد.

تیم بافردو در تلاش هستند با ارایه بهترین و باکیفیت ترین محصولات تجربه خرید متفاوتی را برای مشتریان به وجود آورد.`;
const info2 = `باتوجه به این‌که  محصولات  عرضه شده در بافردو شامل مواد‌غذایی و محصولات فاسد‌شدنی می‌باشد، امکان مرجوع نمودن کالاها فقط در موارد زیر امکان پذیر است.

اشکال و یا ایراد محصول باید حداکثر تا ۱ روز کاری پس از دریافت کالا، به واحد خدمات مشتریان بافردو اطلاع داده شود. در این صورت اشکال محصول توسط کارشناسان بافردو بررسی می شود و در صورت تایید اشکال محصول تعویض و یا مبلغ دریافتی آن عودت می گردد.

اگر مشخصات محصول دریافت شده با سفارش ثبت شده مغایرت داشته باشد  باید محصول در شرایط اولیه خود باشد و مشتری از آن استفاده نکرده باشد و از طریق تماس با شماره تلفن ۴۴۹۶۹۱۷۵ اطلاع دهد تا مشکل مورد بررسی قرار گیرد.

در صورت انصراف کاربر از خرید، باید هر چه سریع‌‏تر و پیش از ارسال محصول انصراف خود را به واحد خدمات مشتریان بافردو از طریق شماره تلفن ۴۴۹۶۹۱۷۵  اطلاع دهد. در این حالت امکان لغو و یا تغییر سفارش وجود دارد.

در صورتی که محصول مورد نظر در حمل و نقل آسیب دیده باشد و یا بسته‌بندی آن در زمان حمل دچار آسیب شده باشد، شما می‏ توانید از تحویل گرفتن محصول خودداری نمایید تا جهت بررسی و ارسال مجدد  عودت شود.

در صورت هر گونه مشکل و سوال به واحد مشتریان بافردو به شماره تلفن ۴۴۹۶۹۱۷۵ تماس حاصل نمایید.`;
const info3 = `ثبت سفارش در تمامی ساعات شبانه‌روز و هفت روز هفته امکان‌پذیر است.  ارسال سفارشات در روزهای کاری از ساعت ۱۳ الی ۱۵ صورت می‌گیرد.

بعد از نهایی‌کردن سفارش این امکان برای کاربر وجود دارد که زمان تحویل محصول را خود تعیین نماید.

ارسال سفارش برای تمام سفارش‌های بیش از ۱۰۰۰۰۰تومان  رایگان و برای سفارشات کمتر از ۱۰۰۰۰۰ تومان، ۱۵۰۰۰ تومان هزینه‌ی حمل و نقل لحاظ می‌شود و ارسال برای سفارشات زیر ۵۰ هزار تومان نیز صورت نمی پذیرد.

درصورت بروز مشکل در پردازش نهایی سبد خرید مانند اتمام موجودی کالا یا انصراف کاربر، مبلغ پرداخت شده در اسرع وقت به حساب ایشان واریز خواهد شد.

کاربران می بایست فرم سفارش محصول را با دقت کامل و بدون اشتباه تکمیل نمایند. در صورت وارد کردن اطلاعات ناقص و یا اشتباه سفارش آن ها قابل پیگیری و ارسال نخواهد بود.`;
const CONTENT = [
	{
		id: '0',
		categoryName: 'درباره بافردو',
		subCategory: [ { id: '0', name: info1 } ]
	},
	{
		id: '1',
		categoryName: 'شرایط بازگشت کالا',
		subCategory: [ { id: '1', name: info2 } ]
	},
	{
		id: '2',
		categoryName: 'ثبت، پردازش و ارسال سفارش',
		subCategory: [ { id: '2', name: info3 } ]
	}
];
function List() {
	return (
		<ExpandableListView
			data={CONTENT}
			ExpandableListViewStyles={{
				marginTop: -10
			}}
			renderItemSeparator={true}
			itemContainerStyle={{ backgroundColor: 'white' }}
			innerItemContainerStyle={{ backgroundColor: 'white' }}
			itemLabelStyle={{ marginLeft: 'auto', fontFamily: 'Vazir' }}
			animated={false}
			innerItemLabelStyle={{ textAlign: 'right', paddingBottom: 10, fontFamily: 'Vazir', fontSize: 12 }}
		/>
	);
}

export default List;
